//姓名：聂冬   学号：2006702-02 
//程序问题：求某年某月某日
 
#include<stdio.h>
int main()
{
	int a,b,c,f=30,g=31,n;
	printf("输入某年某月某日（例：2010-5-11）:");
	scanf("%d-%d-%d",&a,&b,&c); 
	if((a%4==0&&a%100!=0)||a%400==0)
	{
		if(b==1)
		n=c;
		if(b==3||b==5||b==7)
		n=(((b+1)/2)-1)*g+((b-1)/2)*f-1+c;
		if(b==10||b==12)
		n=(((b+2)/2)-1)*g+((b-2)/2)*f-1+c;
		if(b==2)
		n=g+c;
		if(b==4||b==6)
		n=(b/2)*g+((b-2)/2)*f-1+c;
		if(b==9||b==11)
		n=((b+1)/2)*g+((b-3)/2)*f-1+c;
	}
	    if(b==1)
		n=c;
		if(b==3||b==5||b==7)
		n=(((b+1)/2)-1)*g+((b-1)/2)*f-2+c;
		if(b==10||b==12)
		n=(((b+2)/2)-1)*g+((b-2)/2)*f-2+c;
		if(b==2)
		n=g+c;
		if(b==4||b==6)
		n=(b/2)*g+((b-2)/2)*f-2+c;
		if(b==9||b==11)
		n=((b+1)/2)*g+((b-3)/2)*f-2+c;
		printf("第%d年的%d天\n",a,n);
 } 
