//姓名：聂冬   学号：2006702-02 
//程序问题：求所有具有这种特点的真分子（非约简真分数）的个数以及分子与分母之和
 
#include<stdio.h>                 //非约简真分数：若某真分数满足下述条件：
int main()                        //  ①分子分母都是两位正整数；
{                                 // ②分子的两位数字之和与分母的两位数字之和组成新的分数，该分数与原分数的值相等
	int a,b,c,d,i,j,n=0,s=0;      //例：63/84=(6+3)/(8+4) 
	for(i=10;i<=99;i++)
	{
		a=i/10;
		b=i%10;
		for(j=i+1;j<=99;j++)
		{
			c=j/10;
			d=j%10;
			if(i*(c+d)==j*(a+b))
			{
				n++;
				s=s+i+j;
				printf("i=%d,j=%d,n=%d,s=%d\n",i,j,n,s);
			}
		}
	}
 } 
